/*
 *  NWNeXalt - Empty File
 *  (c) 2007 Doug Swarin (zac@intertex.net)
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program; if not, write to the Free Software
 *  Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
 *
 *  $Id$
 *  $HeadURL$
 *
 */

#ifndef _NX_NWN_STRUCT_CLASTUPDATEOBJECT_
#define _NX_NWN_STRUCT_CLASTUPDATEOBJECT_

struct CLastUpdateObject_s {
    uint32_t    field_0000;                 /* 0000 */
    uint32_t    field_0004;                 /* 0004 */
    uint32_t    field_0008;                 /* 0008 */
    uint32_t    lou_chest_objid;            /* 000C */
    uint32_t    field_0010;                 /* 0010 */
    uint16_t    lou_appearance;             /* 0014 */
    uint16_t    field_0016;                 /* 0016 */
    uint32_t    field_0018;                 /* 0018 */
    uint32_t    field_001C;                 /* 001C */
    uint32_t    field_0020;                 /* 0020 */
    uint32_t    field_0024;                 /* 0024 */
    uint32_t    field_0028;                 /* 0028 */
    uint32_t    field_002C;                 /* 002C */
    uint32_t    field_0030;                 /* 0030 */
    uint32_t    field_0034;                 /* 0034 */
    uint32_t    field_0038;                 /* 0038 */
    uint32_t    field_003C;                 /* 003C */
    uint32_t    field_0040;                 /* 0040 */
    uint32_t    field_0044;                 /* 0044 */
    uint32_t    field_0048;                 /* 0048 */
    nwn_objid_t lou_obj_id;                 /* 004C */
    uint32_t    field_0050;                 /* 0050 */
    uint32_t    field_0054;                /* 0054 */
    uint32_t    field_0058;                /* 0058 */
    uint32_t    field_005C;                /* 005C */
    uint32_t    field_0060;                /* 0060 */
    uint32_t    field_0064;                /* 0064 */
    uint32_t    field_0068;                /* 0068 */
    uint32_t    field_006C;                /* 006C */
    uint32_t    field_0070;                /* 0070 */
    uint32_t    field_0074;                /* 0074 */
    uint32_t    field_0078;                /* 0078 */
    uint32_t    field_007C;                /* 007C */
    uint32_t    field_0080;                /* 0080 */
    uint32_t    field_0084;                /* 0084 */
    uint32_t    field_0088;                /* 0088 */
    uint32_t    field_008C;                /* 008C */
    uint32_t    field_0090;                /* 0090 */
    uint32_t    field_0094;                /* 0094 */
    uint32_t    field_0098;                /* 0098 */
    uint32_t    field_009C;                /* 009C */
    uint32_t    field_00A0;                /* 00A0 */
    uint32_t    field_00A4;                /* 00A4 */
    uint32_t    field_00A8;                /* 00A8 */
    uint32_t    field_00AC;                /* 00AC */
    uint32_t    field_00B0;                /* 00B0 */
    uint32_t    field_00B4;                /* 00B4 */
    uint32_t    field_00B8;                /* 00B8 */
    uint32_t    field_00BC;                /* 00BC */
    uint32_t    field_00C0;                /* 00C0 */
    uint32_t    field_00C4;                /* 00C4 */
    uint32_t    field_00C8;                /* 00C8 */
    uint32_t    field_00CC;                /* 00CC */
    uint32_t    field_00D0;                /* 00D0 */
    uint32_t    field_00D4;                /* 00D4 */
    uint32_t    field_00D8;                /* 00D8 */
    uint32_t    field_00DC;                /* 00DC */
    uint32_t    field_00E0;                /* 00E0 */
    uint32_t    field_00E4;                /* 00E4 */
    uint32_t    field_00E8;                /* 00E8 */
    uint32_t    field_00EC;                /* 00EC */
    uint32_t    field_00F0;                /* 00F0 */
    uint32_t    field_00F4;                /* 00F4 */
    uint32_t    field_00F8;                /* 00F8 */
    uint32_t    field_00FC;                /* 00FC */
    uint32_t    field_0100;                /* 0100 */
    uint32_t    field_0104;                /* 0104 */
    uint32_t    field_0108;                /* 0108 */
    uint32_t    field_010C;                /* 010C */
    uint32_t    field_0110;                /* 0110 */
    uint32_t    field_0114;                /* 0114 */
    uint32_t    field_0118;                /* 0118 */
    uint32_t    field_011C;                /* 011C */
    uint32_t    field_0120;                /* 0120 */
    uint32_t    field_0124;                /* 0124 */
    uint32_t    field_0128;                /* 0128 */
    uint32_t    field_012C;                /* 012C */
    uint32_t    field_0130;                /* 0130 */
    uint32_t    field_0134;                /* 0134 */
    uint32_t    field_0138;                /* 0138 */
    uint32_t    field_013C;                /* 013C */
    uint32_t    field_0140;                /* 0140 */
    uint32_t    field_0144;                /* 0144 */
    uint32_t    field_0148;                /* 0148 */
    uint32_t    field_014C;                /* 014C */
    uint32_t    field_0150;                /* 0150 */
    uint32_t    field_0154;                /* 0154 */
    uint32_t    field_0158;                /* 0158 */
    uint32_t    field_015C;                /* 015C */
    uint32_t    field_0160;                /* 0160 */
    uint32_t    field_0164;                /* 0164 */
    uint32_t    field_0168;                /* 0168 */
    uint32_t    field_016C;                /* 016C */
};
#endif /* _NX_NWN_STRUCT_CLASTUPDATEOBJECT_ */

/* vim: set sw=4: */
