/*
 *  NWNeXalt - Empty File
 *  (c) 2007 Doug Swarin (zac@intertex.net)
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program; if not, write to the Free Software
 *  Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
 *
 *  $Id$
 *  $HeadURL$
 *
 */

#ifndef _NX_NWN_STRUCT_CNWSSOUNDOBJECT_
#define _NX_NWN_STRUCT_CNWSSOUNDOBJECT_

struct CNWSSoundObject_s {
    CNWSObject            obj;
    uint32_t              field_01C4;          /* 01C4 */
    uint32_t              field_01C8;          /* 01C8 */
    uint32_t              field_01CC;          /* 01CC */
    uint32_t              field_01D0;          /* 01D0 */
    uint32_t              field_01D4;          /* 01D4 */
    uint32_t              field_01D8;          /* 01D8 */
    uint32_t              field_01DC;          /* 01DC */
    uint32_t              field_01E0;          /* 01E0 */
    uint32_t              field_01E4;          /* 01E4 */
    uint32_t              field_01E8;          /* 01E8 */
    uint32_t              field_01EC;          /* 01EC */
    uint32_t              field_01F0;          /* 01F0 */
    uint32_t              field_01F4;          /* 01F4 */
    uint32_t              field_01F8;          /* 01F8 */
    uint32_t              field_01FC;          /* 01FC */
    uint32_t              field_0200;          /* 0200 */
    uint32_t              field_0204;          /* 0204 */
    uint32_t              field_0208;          /* 0208 */
    uint32_t              field_020C;          /* 020C */
    uint32_t              field_0210;          /* 0210 */
    uint32_t              field_0214;          /* 0214 */
};

#endif /* _NX_NWN_STRUCT_CNWSSOUNDOBJECT_ */

/* vim: set sw=4: */
