#ifndef _NX_NWN_STRUCT_CSERVERINFO_
#define _NX_NWN_STRUCT_CSERVERINFO_

struct CServerInfo_s {
   uint32_t    field_00;                /* 0000 */
   uint32_t    field_04;                /* 0004 */
   uint32_t    field_08;                /* 0008 */
   uint32_t    field_0C;                /* 000C */
   uint32_t    field_10;                /* 0010 */
   uint32_t    field_14;                /* 0014 */
   uint32_t    field_18;                /* 0018 */
   uint32_t    field_1C;                /* 001C */
   uint32_t    field_20;                /* 0020 */
   uint32_t    field_24;                /* 0024 */
   uint32_t    field_28;                /* 0028 */
   uint32_t    field_2C;                /* 002C */
   uint32_t    field_30;                /* 0030 */
   uint32_t    field_34;                /* 0034 */
   uint32_t    field_38;                /* 0038 */
   uint32_t    field_3C;                /* 003C */
   uint32_t    field_40;                /* 0040 */
   uint32_t    field_44;                /* 0044 */
   uint32_t    field_48;                /* 0048 */
   uint32_t    field_4C;                /* 004C */
   uint32_t    field_50;                /* 0050 */
   uint32_t    field_54;                /* 0054 */
   uint32_t    field_58;                /* 0058 */
   uint32_t    field_5C;                /* 005C */
   uint32_t    field_60;                /* 0060 */
   uint32_t    field_64;                /* 0064 */
   uint32_t    field_68;                /* 0068 */
   uint32_t    field_6C;                /* 006C */
   uint32_t    field_70;                /* 0070 */
   uint32_t    field_74;                /* 0074 */
   uint32_t    field_78;                /* 0078 */
   uint32_t    field_7C;                /* 007C */
   uint32_t    field_80;                /* 0080 */
   uint32_t    field_84;                /* 0084 */
   uint32_t    field_88;                /* 0088 */
   uint32_t    field_8C;                /* 008C */
   uint32_t    field_90;                /* 0090 */
   uint32_t    field_94;                /* 0094 */
   uint32_t    field_98;                /* 0098 */
   uint32_t    field_9C;                /* 009C */
   uint32_t    field_A0;                /* 00A0 */
   uint32_t    field_A4;                /* 00A4 */
   uint32_t    field_A8;                /* 00A8 */
   uint32_t    field_AC;                /* 00AC */
   uint32_t    sri_min_level;           /* 00B0 */
   uint32_t    sri_max_level;           /* 00B4 */
   uint32_t    field_B8;                /* 00B8 */
   uint32_t    field_BC;                /* 00BC */
   uint32_t    field_C0;                /* 00C0 */
   uint32_t    field_C4;                /* 00C4 */
   uint32_t    field_C8;                /* 00C8 */
   uint32_t    field_CC;                /* 00CC */
   uint32_t    field_D0;                /* 00D0 */
   uint32_t    field_D4;                /* 00D4 */
   uint32_t    field_D8;                /* 00D8 */
   uint32_t    field_DC;                /* 00DC */
   uint32_t    field_E0;                /* 00E0 */
   uint32_t    sri_difficulty;          /* 00E4 */
   uint32_t    field_E8;                /* 00E8 */
   uint32_t    field_EC;                /* 00EC */
   uint32_t    field_F0;                /* 00F0 */
   int32_t     sri_using_irl;           /* 00F4 */
   uint32_t    field_F8;                /* 00F8 */
   uint32_t    field_FC;                /* 00FC */
   uint32_t    field_100;               /* 0100 */
   uint32_t    field_104;               /* 0104 */
   uint32_t    field_108;               /* 0108 */
   uint32_t    field_10C;               /* 010C */
   uint32_t    field_110;               /* 0110 */
   uint32_t    field_114;               /* 0114 */
   uint32_t    sri_max_hp;              /* 0118 */
   uint32_t    field_11C;               /* 011C */
   uint32_t    field_120;               /* 0120 */
   uint32_t    sri_hide_hp;             /* 0124 */
   uint32_t    field_128;                /* 0128 */
   uint32_t    field_12C;                /* 012C */
   uint32_t    field_130;                /* 0130 */
   uint32_t    field_134;                /* 0134 */
   uint32_t    field_138;                /* 0138 */
   uint32_t    field_13C;                /* 013C */
   uint32_t    field_140;                /* 0140 */
   uint32_t    field_144;                /* 0144 */
   uint32_t    field_148;                /* 0148 */
   uint32_t    field_14C;                /* 014C */
   uint32_t    field_150;                /* 0150 */
   uint32_t    field_154;                /* 0154 */
   uint32_t    field_158;                /* 0158 */
   uint32_t    field_15C;                /* 015C */
   uint32_t    field_160;                /* 0160 */
   uint32_t    field_164;                /* 0164 */
   uint32_t    field_168;                /* 0168 */
   uint32_t    field_16C;                /* 016C */
   uint32_t    sri_game_difficulty;      /* 0170 */
   uint32_t    field_174;                /* 0174 */
   uint32_t    field_178;                /* 0178 */
   uint32_t    field_17C;                /* 017C */
   uint32_t    field_180;                /* 0180 */
   uint32_t    field_184;                /* 0184 */
   uint32_t    field_188;                /* 0188 */
   uint32_t    field_18C;                /* 018C */
   uint32_t    field_190;                /* 0190 */
   uint32_t    field_194;                /* 0194 */
   uint32_t    field_198;                /* 0198 */
   uint32_t    field_19C;                /* 019C */
   uint32_t    field_1A0;                /* 01A0 */
   uint32_t    field_1A4;                /* 01A4 */
   uint32_t    field_1A8;                /* 01A8 */
   uint32_t    field_1AC;                /* 01AC */
   uint32_t    field_1B0;                /* 01B0 */
   uint32_t    field_1B4;                /* 01B4 */
   uint32_t    field_1B8;                /* 01B8 */
   uint32_t    field_1BC;                /* 01BC */
   uint32_t    field_1C0;                /* 01C0 */
   uint32_t    field_1C4;                /* 01C4 */
   uint32_t    field_1C8;                /* 01C8 */
   uint32_t    field_1CC;                /* 01CC */
   uint32_t    field_1D0;                /* 01D0 */
   uint32_t    field_1D4;                /* 01D4 */
   uint32_t    field_1D8;                /* 01D8 */
   uint32_t    field_1DC;                /* 01DC */
   uint32_t    field_1E0;                /* 01E0 */
   uint32_t    field_1E4;                /* 01E4 */
   uint32_t    field_1E8;                /* 01E8 */
   uint32_t    field_1EC;                /* 01EC */
   uint32_t    field_1F0;                /* 01F0 */
   uint32_t    field_1F4;                /* 01F4 */
   uint32_t    field_1F8;                /* 01F8 */
   uint32_t    field_1FC;                /* 01FC */
   uint32_t    field_200;                /* 0200 */
   uint32_t    field_204;                /* 0204 */
   uint32_t    field_208;                /* 0208 */
   uint32_t    field_20C;                /* 020C */
   uint32_t    field_210;                /* 0210 */
   uint32_t    field_214;                /* 0214 */
   uint32_t    field_218;                /* 0218 */
   uint32_t    field_21C;                /* 021C */
   uint32_t    field_220;                /* 0220 */
   uint32_t    field_224;                /* 0224 */
   uint32_t    field_228;                /* 0228 */
   uint32_t    field_22C;                /* 022C */
   uint32_t    field_230;                /* 0230 */
   uint32_t    field_234;                /* 0234 */
   uint32_t    field_238;                /* 0238 */
   uint32_t    field_23C;                /* 023C */
   uint32_t    field_240;                /* 0240 */
   uint32_t    field_244;                /* 0244 */
   uint32_t    field_248;                /* 0248 */
   uint32_t    field_24C;                /* 024C */
   uint32_t    field_250;                /* 0250 */
   uint32_t    field_254;                /* 0254 */
   uint32_t    field_258;                /* 0258 */
   uint32_t    field_25C;                /* 025C */
   uint32_t    field_260;                /* 0260 */
   uint32_t    field_264;                /* 0264 */
   uint32_t    field_268;                /* 0268 */
   uint32_t    field_26C;                /* 026C */
   uint32_t    field_270;                /* 0270 */
   uint32_t    field_274;                /* 0274 */
   uint32_t    field_278;                /* 0278 */
   uint32_t    field_27C;                /* 027C */
   uint32_t    field_280;                /* 0280 */
   uint32_t    field_284;                /* 0284 */
   uint32_t    field_288;                /* 0288 */
   uint32_t    field_28C;                /* 028C */
   uint32_t    field_290;                /* 0290 */
   uint32_t    field_294;                /* 0294 */
   uint32_t    field_298;                /* 0298 */
   uint32_t    field_29C;                /* 029C */
   uint32_t    field_2A0;                /* 02A0 */
   uint32_t    field_2A4;                /* 02A4 */
   uint32_t    field_2A8;                /* 02A8 */
   uint32_t    field_2AC;                /* 02AC */
   uint32_t    field_2B0;                /* 02B0 */
   uint32_t    field_2B4;                /* 02B4 */
   uint32_t    field_2B8;                /* 02B8 */
   uint32_t    field_2BC;                /* 02BC */
   uint32_t    field_2C0;                /* 02C0 */
   uint32_t    field_2C4;                /* 02C4 */
   uint32_t    field_2C8;                /* 02C8 */
   uint32_t    field_2CC;                /* 02CC */
   uint32_t    field_2D0;                /* 02D0 */
   uint32_t    field_2D4;                /* 02D4 */
   uint32_t    field_2D8;                /* 02D8 */
   uint32_t    field_2DC;                /* 02DC */
   uint32_t    field_2E0;                /* 02E0 */
   uint32_t    field_2E4;                /* 02E4 */
   uint32_t    field_2E8;                /* 02E8 */
   uint32_t    field_2EC;                /* 02EC */
   uint32_t    field_2F0;                /* 02F0 */
   uint32_t    field_2F4;                /* 02F4 */
   uint32_t    field_2F8;                /* 02F8 */
   uint32_t    field_2FC;                /* 02FC */
   uint32_t    field_300;                /* 0300 */
   uint32_t    field_304;                /* 0304 */
   uint32_t    field_308;                /* 0308 */
   uint32_t    field_30C;                /* 030C */
   uint32_t    field_310;                /* 0310 */
   uint32_t    field_314;                /* 0314 */
   uint32_t    field_318;                /* 0318 */
   uint32_t    field_31C;                /* 031C */
   uint32_t    field_320;                /* 0320 */
   uint32_t    field_324;                /* 0324 */
   uint32_t    field_328;                /* 0328 */
   uint32_t    field_32C;                /* 032C */
   uint32_t    field_330;                /* 0330 */
   uint32_t    field_334;                /* 0334 */
   uint32_t    field_338;                /* 0338 */
   uint32_t    field_33C;                /* 033C */
   uint32_t    field_340;                /* 0340 */
   uint32_t    field_344;                /* 0344 */
   uint32_t    field_348;                /* 0348 */
   uint32_t    field_34C;                /* 034C */
   uint32_t    field_350;                /* 0350 */
   uint32_t    field_354;                /* 0354 */
   uint32_t    field_358;                /* 0358 */
   uint32_t    field_35C;                /* 035C */
   uint32_t    field_360;                /* 0360 */
   uint32_t    field_364;                /* 0364 */
   uint32_t    field_368;                /* 0368 */
   uint32_t    field_36C;                /* 036C */
   uint32_t    field_370;                /* 0370 */
   uint32_t    field_374;                /* 0374 */
   uint32_t    field_378;                /* 0378 */
   uint32_t    field_37C;                /* 037C */
   uint32_t    field_380;                /* 0380 */
   uint32_t    field_384;                /* 0384 */
   uint32_t    field_388;                /* 0388 */
   uint32_t    field_38C;                /* 038C */
   uint32_t    field_390;                /* 0390 */
   uint32_t    field_394;                /* 0394 */
   uint32_t    field_398;                /* 0398 */
   uint32_t    field_39C;                /* 039C */
   uint32_t    field_3A0;                /* 03A0 */
   uint32_t    field_3A4;                /* 03A4 */
   uint32_t    field_3A8;                /* 03A8 */
   uint32_t    field_3AC;                /* 03AC */
   uint32_t    field_3B0;                /* 03B0 */
   uint32_t    field_3B4;                /* 03B4 */
   uint32_t    field_3B8;                /* 03B8 */
   uint32_t    field_3BC;                /* 03BC */
   uint32_t    field_3C0;                /* 03C0 */
   uint32_t    field_3C4;                /* 03C4 */
   uint32_t    field_3C8;                /* 03C8 */
   uint32_t    field_3CC;                /* 03CC */
   uint32_t    field_3D0;                /* 03D0 */
   uint32_t    field_3D4;                /* 03D4 */
   uint32_t    field_3D8;                /* 03D8 */
   uint32_t    field_3DC;                /* 03DC */
   uint32_t    field_3E0;                /* 03E0 */
   uint32_t    field_3E4;                /* 03E4 */
   uint32_t    field_3E8;                /* 03E8 */
   uint32_t    field_3EC;                /* 03EC */
   uint32_t    field_3F0;                /* 03F0 */
   uint32_t    field_3F4;                /* 03F4 */
   uint32_t    field_3F8;                /* 03F8 */
   uint32_t    field_3FC;                /* 03FC */
   uint32_t    field_400;                /* 0400 */
   uint32_t    field_404;                /* 0404 */
   uint32_t    field_408;                /* 0408 */
   uint32_t    field_40C;                /* 040C */
   uint32_t    field_410;                /* 0410 */
   uint32_t    field_414;                /* 0414 */
   uint32_t    field_418;                /* 0418 */
   uint32_t    field_41C;                /* 041C */
   uint32_t    field_420;                /* 0420 */
   uint32_t    field_424;                /* 0424 */
   uint32_t    field_428;                /* 0428 */
   uint32_t    field_42C;                /* 042C */
   uint32_t    field_430;                /* 0430 */
   uint32_t    field_434;                /* 0434 */
   uint32_t    field_438;                /* 0438 */
   uint32_t    field_43C;                /* 043C */
   uint32_t    field_440;                /* 0440 */
   uint32_t    field_444;                /* 0444 */
   uint32_t    field_448;                /* 0448 */
   uint32_t    field_44C;                /* 044C */
   uint32_t    field_450;                /* 0450 */
   uint32_t    field_454;                /* 0454 */
   uint32_t    field_458;                /* 0458 */
   uint32_t    field_45C;                /* 045C */
   uint32_t    field_460;                /* 0460 */
   uint32_t    field_464;                /* 0464 */
   uint32_t    field_468;                /* 0468 */
   uint32_t    field_46C;                /* 046C */
   uint32_t    field_470;                /* 0470 */
   uint32_t    field_474;                /* 0474 */
   uint32_t    field_478;                /* 0478 */
   uint32_t    field_47C;                /* 047C */
   uint32_t    field_480;                /* 0480 */
   uint32_t    field_484;                /* 0484 */
   uint32_t    field_488;                /* 0488 */
   uint32_t    field_48C;                /* 048C */
   uint32_t    field_490;                /* 0490 */
};

#endif

