#ifndef _CSERVERINFO_H_
#define _CSERVERINFO_H_
#include "nwndef.h"
#include "CExoString.h"

class CServerInfo
{
public:
    int FindOptionIndex(CExoString, CExoString);
    void SetDifficultyLevel(int, int);
    CServerInfo();

    /* 0x0/0 */ unsigned long field_0;
    /* 0x4/4 */ unsigned long field_4;
    /* 0x8/8 */ unsigned long field_8;
    /* 0xC/12 */ unsigned long field_C;
    /* 0x10/16 */ unsigned long field_10;
    /* 0x14/20 */ unsigned long field_14;
    /* 0x18/24 */ unsigned long field_18;
    /* 0x1C/28 */ unsigned long field_1C;
    /* 0x20/32 */ unsigned long field_20;
    /* 0x24/36 */ unsigned long field_24;
    /* 0x28/40 */ unsigned long field_28;
    /* 0x2C/44 */ unsigned long field_2C;
    /* 0x30/48 */ unsigned long field_30;
    /* 0x34/52 */ unsigned long field_34;
    /* 0x38/56 */ unsigned long field_38;
    /* 0x3C/60 */ unsigned long field_3C;
    /* 0x40/64 */ unsigned long field_40;
    /* 0x44/68 */ unsigned long field_44;
    /* 0x48/72 */ unsigned long field_48;
    /* 0x4C/76 */ unsigned long field_4C;
    /* 0x50/80 */ unsigned long field_50;
    /* 0x54/84 */ unsigned long field_54;
    /* 0x58/88 */ unsigned long field_58;
    /* 0x5C/92 */ unsigned long field_5C;
    /* 0x60/96 */ unsigned long field_60;
    /* 0x64/100 */ unsigned long field_64;
    /* 0x68/104 */ unsigned long field_68;
    /* 0x6C/108 */ unsigned long field_6C;
    /* 0x70/112 */ unsigned long field_70;
    /* 0x74/116 */ unsigned long field_74;
    /* 0x78/120 */ unsigned long field_78;
    /* 0x7C/124 */ unsigned long field_7C;
    /* 0x80/128 */ unsigned long field_80;
    /* 0x84/132 */ unsigned long field_84;
    /* 0x88/136 */ unsigned long field_88;
    /* 0x8C/140 */ unsigned long field_8C;
    /* 0x90/144 */ unsigned long field_90;
    /* 0x94/148 */ unsigned long field_94;
    /* 0x98/152 */ unsigned long field_98;
    /* 0x9C/156 */ unsigned long field_9C;
    /* 0xA0/160 */ unsigned long MaximumPlayers;
    /* 0xA4/164 */ unsigned long field_A4;
    /* 0xA8/168 */ unsigned long field_A8;
    /* 0xAC/172 */ unsigned long field_AC;
    /* 0xB0/176 */ unsigned long MinimumLevel;
    /* 0xB4/180 */ unsigned long MaximumLevel;
    /* 0xB8/184 */ unsigned long AllowLocalChars;
    /* 0xBC/188 */ unsigned long field_BC;
    /* 0xC0/192 */ unsigned long field_C0;
    /* 0xC4/196 */ unsigned long field_C4;
    /* 0xC8/200 */ unsigned long field_C8;
    /* 0xCC/204 */ unsigned long field_CC;
    /* 0xD0/208 */ unsigned long field_D0;
    /* 0xD4/212 */ unsigned long field_D4;
    /* 0xD8/216 */ unsigned long field_D8;
    /* 0xDC/220 */ unsigned long field_DC;
    /* 0xE0/224 */ unsigned long field_E0;
    /* 0xE4/228 */ unsigned long Difficulty;
    /* 0xE8/232 */ unsigned long PauseAndPlay;
    /* 0xEC/236 */ unsigned long OneParty;
    /* 0xF0/240 */ unsigned long EnforceLegalCharacters;
    /* 0xF4/244 */ unsigned long ItemLevelRestrictions;
    /* 0xF8/248 */ unsigned long CDBannedBehavior;
    /* 0xFC/252 */ unsigned long DisallowShouting;
    /* 0x100/256 */ unsigned long ShowDMJoinedMessage;
    /* 0x104/260 */ unsigned long BackupSavedChars;
    /* 0x108/264 */ unsigned long AutoFail1;
    /* 0x10C/268 */ unsigned long ValidateSpells;
    /* 0x110/272 */ unsigned long ExamineEffects;
    /* 0x114/276 */ unsigned long ExamineCR;
    /* 0x118/280 */ unsigned long MaxHP;
    /* 0x11C/284 */ unsigned long RestoreSpellUses;
    /* 0x120/288 */ unsigned long ResetEncounterSpawns;
    /* 0x124/292 */ unsigned long HideHPGained;
    /* 0x128/296 */ unsigned long field_128;
    /* 0x12C/300 */ unsigned long field_12C;
    /* 0x130/304 */ unsigned long field_130;
    /* 0x134/308 */ unsigned long field_134;
    /* 0x138/312 */ unsigned long field_138;
    /* 0x13C/316 */ unsigned long field_13C;
    /* 0x140/320 */ unsigned long field_140;
    /* 0x144/324 */ unsigned long field_144;
    /* 0x148/328 */ unsigned long field_148;
    /* 0x14C/332 */ unsigned long VaultCharsOnly;
    /* 0x150/336 */ unsigned long SaveCharsInSaveGame;
    /* 0x154/340 */ unsigned long SuppressBaseServervault;
    /* 0x158/344 */ unsigned long GameRegion;
    /* 0x15C/348 */ unsigned long field_15C;
    /* 0x160/352 */ unsigned long field_160;
    /* 0x164/356 */ unsigned long field_164;
    /* 0168 */ uint32_t field_168;
    /* 016C */ uint32_t field_16C;
    /* 0170 */ uint32_t GameDifficulty;
    /* 0174 */ uint32_t field_174;
    /* 0178 */ uint32_t field_178;
    /* 017C */ uint32_t field_17C;
    /* 0180 */ uint32_t field_180;
    /* 0184 */ uint32_t field_184;
    /* 0188 */ uint32_t field_188;
    /* 018C */ uint32_t field_18C;
    /* 0190 */ uint32_t field_190;
    /* 0194 */ uint32_t field_194;
    /* 0198 */ uint32_t field_198;
    /* 019C */ uint32_t field_19C;
    /* 01A0 */ uint32_t field_1A0;
    /* 01A4 */ uint32_t field_1A4;
    /* 01A8 */ uint32_t field_1A8;
    /* 01AC */ uint32_t field_1AC;
    /* 01B0 */ uint32_t field_1B0;
    /* 01B4 */ uint32_t field_1B4;
    /* 01B8 */ uint32_t field_1B8;
    /* 01BC */ uint32_t field_1BC;
    /* 01C0 */ uint32_t field_1C0;
    /* 01C4 */ uint32_t field_1C4;
    /* 01C8 */ uint32_t field_1C8;
    /* 01CC */ uint32_t field_1CC;
    /* 01D0 */ uint32_t field_1D0;
    /* 01D4 */ uint32_t field_1D4;
    /* 01D8 */ uint32_t field_1D8;
    /* 01DC */ uint32_t field_1DC;
    /* 01E0 */ uint32_t field_1E0;
    /* 01E4 */ uint32_t field_1E4;
    /* 01E8 */ uint32_t field_1E8;
    /* 01EC */ uint32_t field_1EC;
    /* 01F0 */ uint32_t field_1F0;
    /* 01F4 */ uint32_t field_1F4;
    /* 01F8 */ uint32_t field_1F8;
    /* 01FC */ uint32_t field_1FC;
    /* 0200 */ uint32_t field_200;
    /* 0204 */ uint32_t field_204;
    /* 0208 */ uint32_t field_208;
    /* 020C */ uint32_t field_20C;
    /* 0210 */ uint32_t field_210;
    /* 0214 */ uint32_t field_214;
    /* 0218 */ uint32_t field_218;
    /* 021C */ uint32_t field_21C;
    /* 0220 */ uint32_t field_220;
    /* 0224 */ uint32_t field_224;
    /* 0228 */ uint32_t field_228;
    /* 022C */ uint32_t field_22C;
    /* 0230 */ uint32_t field_230;
    /* 0234 */ uint32_t field_234;
    /* 0238 */ uint32_t field_238;
    /* 023C */ uint32_t field_23C;
    /* 0240 */ uint32_t field_240;
    /* 0244 */ uint32_t field_244;
    /* 0248 */ uint32_t field_248;
    /* 024C */ uint32_t field_24C;
    /* 0250 */ uint32_t field_250;
    /* 0254 */ uint32_t field_254;
    /* 0258 */ uint32_t field_258;
    /* 025C */ uint32_t field_25C;
    /* 0260 */ uint32_t field_260;
    /* 0264 */ uint32_t field_264;
    /* 0268 */ uint32_t field_268;
    /* 026C */ uint32_t field_26C;
    /* 0270 */ uint32_t field_270;
    /* 0274 */ uint32_t field_274;
    /* 0278 */ uint32_t field_278;
    /* 027C */ uint32_t field_27C;
    /* 0280 */ uint32_t field_280;
    /* 0284 */ uint32_t field_284;
    /* 0288 */ uint32_t field_288;
    /* 028C */ uint32_t field_28C;
    /* 0290 */ uint32_t field_290;
    /* 0294 */ uint32_t field_294;
    /* 0298 */ uint32_t field_298;
    /* 029C */ uint32_t field_29C;
    /* 02A0 */ uint32_t field_2A0;
    /* 02A4 */ uint32_t field_2A4;
    /* 02A8 */ uint32_t field_2A8;
    /* 02AC */ uint32_t field_2AC;
    /* 02B0 */ uint32_t field_2B0;
    /* 02B4 */ uint32_t field_2B4;
    /* 02B8 */ uint32_t field_2B8;
    /* 02BC */ uint32_t field_2BC;
    /* 02C0 */ uint32_t field_2C0;
    /* 02C4 */ uint32_t field_2C4;
    /* 02C8 */ uint32_t field_2C8;
    /* 02CC */ uint32_t field_2CC;
    /* 02D0 */ uint32_t field_2D0;
    /* 02D4 */ uint32_t field_2D4;
    /* 02D8 */ uint32_t field_2D8;
    /* 02DC */ uint32_t field_2DC;
    /* 02E0 */ uint32_t field_2E0;
    /* 02E4 */ uint32_t field_2E4;
    /* 02E8 */ uint32_t field_2E8;
    /* 02EC */ uint32_t field_2EC;
    /* 02F0 */ uint32_t field_2F0;
    /* 02F4 */ uint32_t field_2F4;
    /* 02F8 */ uint32_t field_2F8;
    /* 02FC */ uint32_t field_2FC;
    /* 0300 */ uint32_t field_300;
    /* 0304 */ uint32_t field_304;
    /* 0308 */ uint32_t field_308;
    /* 030C */ uint32_t field_30C;
    /* 0310 */ uint32_t field_310;
    /* 0314 */ uint32_t field_314;
    /* 0318 */ uint32_t field_318;
    /* 031C */ uint32_t field_31C;
    /* 0320 */ uint32_t field_320;
    /* 0324 */ uint32_t field_324;
    /* 0328 */ uint32_t field_328;
    /* 032C */ uint32_t field_32C;
    /* 0330 */ uint32_t field_330;
    /* 0334 */ uint32_t field_334;
    /* 0338 */ uint32_t field_338;
    /* 033C */ uint32_t field_33C;
    /* 0340 */ uint32_t field_340;
    /* 0344 */ uint32_t field_344;
    /* 0348 */ uint32_t field_348;
    /* 034C */ uint32_t field_34C;
    /* 0350 */ uint32_t field_350;
    /* 0354 */ uint32_t field_354;
    /* 0358 */ uint32_t field_358;
    /* 035C */ uint32_t field_35C;
    /* 0360 */ uint32_t field_360;
    /* 0364 */ uint32_t field_364;
    /* 0368 */ uint32_t field_368;
    /* 036C */ uint32_t field_36C;
    /* 0370 */ uint32_t field_370;
    /* 0374 */ uint32_t field_374;
    /* 0378 */ uint32_t field_378;
    /* 037C */ uint32_t field_37C;
    /* 0380 */ uint32_t field_380;
    /* 0384 */ uint32_t field_384;
    /* 0388 */ uint32_t field_388;
    /* 038C */ uint32_t field_38C;
    /* 0390 */ uint32_t field_390;
    /* 0394 */ uint32_t field_394;
    /* 0398 */ uint32_t field_398;
    /* 039C */ uint32_t field_39C;
    /* 03A0 */ uint32_t field_3A0;
    /* 03A4 */ uint32_t field_3A4;
    /* 03A8 */ uint32_t field_3A8;
    /* 03AC */ uint32_t field_3AC;
    /* 03B0 */ uint32_t field_3B0;
    /* 03B4 */ uint32_t field_3B4;
    /* 03B8 */ uint32_t field_3B8;
    /* 03BC */ uint32_t field_3BC;
    /* 03C0 */ uint32_t field_3C0;
    /* 03C4 */ uint32_t field_3C4;
    /* 03C8 */ uint32_t field_3C8;
    /* 03CC */ uint32_t field_3CC;
    /* 03D0 */ uint32_t field_3D0;
    /* 03D4 */ uint32_t field_3D4;
    /* 03D8 */ uint32_t field_3D8;
    /* 03DC */ uint32_t field_3DC;
    /* 03E0 */ uint32_t field_3E0;
    /* 03E4 */ uint32_t field_3E4;
    /* 03E8 */ uint32_t field_3E8;
    /* 03EC */ uint32_t field_3EC;
    /* 03F0 */ uint32_t field_3F0;
    /* 03F4 */ uint32_t field_3F4;
    /* 03F8 */ uint32_t field_3F8;
    /* 03FC */ uint32_t field_3FC;
    /* 0400 */ uint32_t field_400;
    /* 0404 */ uint32_t field_404;
    /* 0408 */ uint32_t field_408;
    /* 040C */ uint32_t field_40C;
    /* 0410 */ uint32_t field_410;
    /* 0414 */ uint32_t field_414;
    /* 0418 */ uint32_t field_418;
    /* 041C */ uint32_t field_41C;
    /* 0420 */ uint32_t field_420;
    /* 0424 */ uint32_t field_424;
    /* 0428 */ uint32_t field_428;
    /* 042C */ uint32_t field_42C;
    /* 0430 */ uint32_t field_430;
    /* 0434 */ uint32_t field_434;
    /* 0438 */ uint32_t field_438;
    /* 043C */ uint32_t field_43C;
    /* 0440 */ uint32_t field_440;
    /* 0444 */ uint32_t field_444;
    /* 0448 */ uint32_t field_448;
    /* 044C */ uint32_t field_44C;
    /* 0450 */ uint32_t field_450;
    /* 0454 */ uint32_t field_454;
    /* 0458 */ uint32_t field_458;
    /* 045C */ uint32_t field_45C;
    /* 0460 */ uint32_t field_460;
    /* 0464 */ uint32_t field_464;
    /* 0468 */ uint32_t field_468;
    /* 046C */ uint32_t field_46C;
    /* 0470 */ uint32_t field_470;
    /* 0474 */ uint32_t field_474;
    /* 0478 */ uint32_t field_478;
    /* 047C */ uint32_t field_47C;
    /* 0480 */ uint32_t field_480;
    /* 0484 */ uint32_t field_484;
    /* 0488 */ uint32_t field_488;
    /* 048C */ uint32_t field_48C;
    /* 0490 */ uint32_t field_490;
};

static_assert(sizeof(CServerInfo) == 0x494, "CServerInfo has an incorrect size.");
#endif
